apache/nuttx/arch/arm/src/common/stm32/stm32_serial_m33_u3u5.c
      /* We may still have to read from the DR register to clear any pending
       * error conditions.
       */

      else if ((priv->sr & (USART_ISR_ORE | USART_ISR_NF | USART_ISR_FE))
               != 0)
        {
          /* These errors are cleared by writing the corresponding bit to the
           * interrupt clear register (ICR).
           */

          stm32serial_putreg(priv, STM32_USART_ICR_OFFSET,
                               (USART_ICR_NCF | USART_ICR_ORECF |
                                USART_ICR_FECF));
        }

      /* Handle outgoing, transmit bytes */

      if ((priv->sr & USART_ISR_TXE) != 0 &&
          (priv->ie & USART_CR1_TXEIE) != 0)
        {
          /* Transmit data register empty ... process outgoing bytes */

          uart_xmitchars(&priv->dev);
          handled = true;
        }
    }

  return OK;
}

/****************************************************************************
 * Name: stm32serial_ioctl
 *
 * Description:
 *   All ioctl calls will be routed through this method
 *
 ****************************************************************************/

static int stm32serial_ioctl(struct file *filep, int cmd,
                             unsigned long arg)
{
  struct inode          *inode = filep->f_inode;
  struct uart_dev_s     *dev   = inode->i_private;
  struct stm32_serial_s *priv  = (struct stm32_serial_s *)dev->priv;
  int                    ret   = OK;

  UNUSED(inode);
  UNUSED(dev);
  UNUSED(priv);

  switch (cmd)
    {
#ifdef CONFIG_SERIAL_TIOCSERGSTRUCT
      case TIOCSERGSTRUCT:
        {
          struct stm32_serial_s *user;

          user = (struct stm32_serial_s *)arg;

          if (!user)
            {
              ret = -EINVAL;
            }
          else
            {
              memcpy(user, dev, sizeof(struct stm32_serial_s));
            }
        }
        break;
#endif

#ifdef CONFIG_STM32_USART_SINGLEWIRE
      case TIOCSSINGLEWIRE:
        {
          uint32_t cr;
          uint32_t cr1;
          uint32_t cr1_ue;
          irqstate_t flags;

          flags = enter_critical_section();

          /* Get the original state of UE */

          cr1    = stm32serial_getreg(priv, STM32_USART_CR1_OFFSET);
          cr1_ue = cr1 & USART_CR1_UE;
          cr1   &= ~USART_CR1_UE;

          /* Disable UE, HDSEL can only be written when UE=0 */

          stm32serial_putreg(priv, STM32_USART_CR1_OFFSET, cr1);

          /* Change the TX port to be open-drain/push-pull and enable/disable
           * half-duplex mode.
           */

          cr = stm32serial_getreg(priv, STM32_USART_CR3_OFFSET);

          if ((arg & SER_SINGLEWIRE_ENABLED) != 0)
            {
              uint32_t gpio_val = GPIO_OPENDRAIN;

              if ((arg & SER_SINGLEWIRE_PULL_MASK) == SER_SINGLEWIRE_PULLUP)
                {
                  gpio_val |= GPIO_PULLUP;
                }
              else
                {
                  gpio_val |= GPIO_FLOAT;
                }

              if ((arg & SER_SINGLEWIRE_PULL_MASK) ==
                  SER_SINGLEWIRE_PULLDOWN)
                {
                  gpio_val |= GPIO_PULLDOWN;
                }
              else
                {
                  gpio_val |= GPIO_FLOAT;
                }

              if (priv->tx_gpio != 0)
                {
                  stm32_configgpio((priv->tx_gpio &
                                    ~(GPIO_PUPD_MASK | GPIO_OPENDRAIN)) |
                                    gpio_val);
                }

              cr |= USART_CR3_HDSEL;
            }
          else
            {
              if (priv->tx_gpio != 0)
                {
                  stm32_configgpio((priv->tx_gpio &
                                    ~(GPIO_PUPD_MASK | GPIO_OPENDRAIN)) |
                                    GPIO_PUSHPULL);
                }

              cr &= ~USART_CR3_HDSEL;
            }

          stm32serial_putreg(priv, STM32_USART_CR3_OFFSET, cr);

          /* Re-enable UE if appropriate */

          stm32serial_putreg(priv, STM32_USART_CR1_OFFSET, cr1 | cr1_ue);
          leave_critical_section(flags);
        }
        break;
#endif

#ifdef CONFIG_STM32_USART_INVERT
      case TIOCSINVERT:
        {
          uint32_t cr;
          uint32_t cr1;
          uint32_t cr1_ue;
          irqstate_t flags;

          flags = enter_critical_section();

          /* Get the original state of UE */

          cr1    = stm32serial_getreg(priv, STM32_USART_CR1_OFFSET);
          cr1_ue = cr1 & USART_CR1_UE;
          cr1   &= ~USART_CR1_UE;

          /* Disable UE, {R,T}XINV can only be written when UE=0 */

          stm32serial_putreg(priv, STM32_USART_CR1_OFFSET, cr1);

          /* Enable/disable signal inversion. */

          cr = stm32serial_getreg(priv, STM32_USART_CR2_OFFSET);

          if (arg & SER_INVERT_ENABLED_RX)
            {
              cr |= USART_CR2_RXINV;
            }
          else
            {
              cr &= ~USART_CR2_RXINV;
            }

          if (arg & SER_INVERT_ENABLED_TX)
            {
              cr |= USART_CR2_TXINV;
            }
          else
            {
              cr &= ~USART_CR2_TXINV;
            }

          stm32serial_putreg(priv, STM32_USART_CR2_OFFSET, cr);

          /* Re-enable UE if appropriate */

          stm32serial_putreg(priv, STM32_USART_CR1_OFFSET, cr1 | cr1_ue);
          leave_critical_section(flags);
        }
        break;
#endif

#ifdef CONFIG_STM32_USART_SWAP
      case TIOCSSWAP:
        {
          uint32_t cr;
          uint32_t cr1;
          uint32_t cr1_ue;
          irqstate_t flags;

          flags = enter_critical_section();

          /* Get the original state of UE */

          cr1    = stm32serial_getreg(priv, STM32_USART_CR1_OFFSET);
          cr1_ue = cr1 & USART_CR1_UE;
          cr1   &= ~USART_CR1_UE;

          /* Disable UE, SWAP can only be written when UE=0 */

          stm32serial_putreg(priv, STM32_USART_CR1_OFFSET, cr1);

          /* Enable/disable Swap mode. */

          cr = stm32serial_getreg(priv, STM32_USART_CR2_OFFSET);

          if (arg == SER_SWAP_ENABLED)
            {
              cr |= USART_CR2_SWAP;
            }
          else
            {
              cr &= ~USART_CR2_SWAP;
            }

